insert into types (name)
values ('income'),
       ('expenditure'),
       ('transfer');

insert into categories (type_id, name)
values
    (1, 'Работа'),
    (1, 'Подработка'),
    (1, 'Премия'),
    (1, 'Подарок'),
    (2, 'Покупка дома'),
    (2, 'Ремонт дома'),
    (2, 'ЖКХ'),
    (2, 'Все для дома'),
    (2, 'Путешествия'),
    (2, 'Одежда'),
    (2, 'Гаджеты'),
    (2, 'Праздники'),
    (2, 'Красота и здоровье'),
    (2, 'Образование'),
    (2, 'Еда вне дома'),
    (2, 'Продукты'),
    (2, 'Бары и рестораны'),
    (2, 'Транспорт'),
    (2, 'Транспорт'),
    (2, 'Подарки'),
    (2, 'Здоровье'),
    (2, 'Развлечения'),
    (2, 'Регулярные'),
    (2, 'Прочее');